# -*- coding: utf-8 -*-
"""РК_2.ipynb

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1QsObPXp6rfh4WOi-4m4TNnS-KiQETu8U

# Рубежный контроль №2
## Группа: ИУ5Ц-83Б
## Студент: Соловьева Александра
### Тема: Методы построения моделей машинного обучения.

### Задание
Для заданного набора данных (по Вашему варианту) постройте модели классификации или регрессии (в зависимости от конкретной задачи, рассматриваемой в наборе данных). Для построения моделей используйте методы 1 и 2 (по варианту для Вашей группы). Оцените качество моделей на основе подходящих метрик качества (не менее двух метрик). Какие метрики качества Вы использовали и почему? Какие выводы Вы можете сделать о качестве построенных моделей? Для построения моделей необходимо выполнить требуемую предобработку данных: заполнение пропусков, кодирование категориальных признаков, и т.д.

#### * Номер варианта: 27
#### * Метод №1: Дерево решений
#### * Метод №2: Случайный лес

### Описание исходного набора

Этот набор данных содержит данные о банкротстве из Тайваньского экономического журнала за 1999–2009 гг.

Данные были получены из Тайваньского экономического журнала за период с 1999 по 2009 год. Банкротство компании было определено на основании правил ведения бизнеса Тайваньской фондовой биржи.

Столбцы:
Y = выходной объект, X = входной объект).

* Y - Банкрот?: Ярлык класса
* X1 - ROA(C) до вычета процентов и амортизации до вычета процентов: Рентабельность общих активов(C)
* X2 - ROA(A) до уплаты процентов и % после налогообложения: Рентабельность общих активов(A)
* X3 - ROA (B) до вычета процентов и амортизации после налогообложения: Рентабельность всех активов(B)
* X4 – Валовая прибыль от операционной деятельности: Валовая прибыль/чистая выручка от продаж
* X5 – Валовая прибыль от реализованных продаж: Реализованная валовая прибыль/чистая выручка от продаж
* X6 – Норма операционной прибыли: Операционная прибыль/ Чистая выручка
* X7 – Чистая процентная ставка до налогообложения: Доход/чистая выручка
* X8 – Чистая процентная ставка после уплаты налогов: Чистая прибыль/Чистая выручка
* X9 – Непромышленные доходы и расходы/выручка: Коэффициент чистой внереализационной прибыли
* X10 — Непрерывная процентная ставка (после налогообложения): Чистая прибыль — исключая прибыль или убыток от выбытия / Чистая выручка
* X11 — Ставка операционных расходов: Операционные расходы / Чистая выручка
* X12 — Ставка расходов на исследования и разработки: (Расходы на исследования и разработки) / Чистая выручка
* X13 - Скорость движения денежных средств: Денежный поток от операционных/текущих обязательств
* X14 - Процентная ставка по процентным долгам: Процентные долги/капитал
* X15 - Ставка налога (A): Эффективная налоговая ставка
* X16 - Чистая стоимость одной акции (B): Балансовая стоимость На акцию(B)
* X17 - Чистая стоимость на акцию (A): Балансовая стоимость на акцию(A)
* X18 - Чистая стоимость на акцию (C): Балансовая стоимость на акцию(C)
* X19 - Постоянная прибыль на акцию за последние четыре сезона: прибыль на акцию -Чистый доход
* X20 - Денежный поток на акцию
* X21 — Доход на акцию (в юанях): Продажи на акцию
* X22 — Операционная прибыль на акцию (в юанях): Операционный доход на акцию
* X23 — Чистая прибыль на акцию до налогообложения (в юанях): Доход на акцию до налогообложения
* X24 — Валовой реализованный доход Темп роста прибыли
* X25 - Темп роста операционной прибыли: Рост операционной прибыли
* X26 - Темп роста чистой прибыли после налогообложения: Рост чистой прибыли
* X27 - Темп роста обычной чистой прибыли: Рост текущей операционной прибыли после налогообложения
* X28 - Темп роста постоянной чистой прибыли: Чистая прибыль - Исключая рост прибыли или убытков от выбытия
* X29 - Темп роста общих активов: Рост совокупных активов
* X30 - Темп роста чистой стоимости: Рост совокупных активов
* X31 - Коэффициент темпов роста общей доходности активов: Прибыль к совокупным приростам активов
* X32 - Реинвестирование денежных средств, %: Коэффициент реинвестирования денежных средств
* X33 - Коэффициент текущей ликвидности
* X34 - Коэффициент быстрой ликвидности: тест на кислотность
* X35 - Коэффициент процентных расходов: процентные расходы/общий доход
* X36 - Общий долг/Общий собственный капитал: Коэффициент общих обязательств/капитала
* X37 - Коэффициент долга, % : Обязательства/Общие активы
* X38 - Чистая стоимость/Активы: Собственный капитал/Общие активы
* X39 - Коэффициент пригодности долгосрочного фонда (A): (Долгосрочные обязательства + Собственный капитал)/Основные активы
* X40 - Зависимость от заимствования: Стоимость процентного долга
* X41 – Условные обязательства/Собственный капитал: Условные обязательства/Капитал
* X42 – Операционная прибыль/Оплаченный капитал: Операционный доход/Капитал
* X43 – Чистая прибыль до налогообложения/Оплаченный капитал: Доход/капитал до налогообложения
* X44 — Товарно-материальные запасы и дебиторская задолженность/Чистая стоимость: (Запасы+Дебиторская задолженность)/Собственный капитал
* X45 — Общий оборот активов
* X46 — Оборачиваемость дебиторской задолженности
* X47 — Среднее количество дней сбора: Дни непогашенной дебиторской задолженности X48 — Коэффициент оборачиваемости запасов (раз)
* X49 — Оборачиваемость основных средств Частота
* X50 - Коэффициент оборота чистой стоимости (раз): Оборачиваемость собственного капитала
* X51 - Выручка на человека: Продажи на одного работника
* X52 - Операционная прибыль на человека: Операционный доход на одного работника
* X53 - Коэффициент распределения на человека: Основные средства на одного работника
* X54 - Общий оборотный капитал Активы
* X55 - Быстрые активы/Итого активы
* X56 - Оборотные активы/Итого активы
* X57 - Денежные средства/Итого активы
* X58 – Оборотные активы/Текущие обязательства
* X59 – Денежные средства/Текущие обязательства
* X60 – Текущие обязательства к активам
* X61 – Оборотные средства к обязательствам
* X62 – Запасы/оборотный капитал
* X64 – Текущие обязательства/обязательства
* X65 – Оборотный капитал/капитал
* X66 - Текущие обязательства/капитал
* X67 - Долгосрочные обязательства по текущим активам
* X68 - Нераспределенная прибыль к общей сумме активов
* X69 - Общая прибыль/общая сумма расходов
* X70 - Общая сумма расходов/активов
* X71 - Коэффициент оборачиваемости текущих активов: Текущие активы к продажам
* X72 - Быстрая оборачиваемость активов Отношение оборотных средств к продажам
* X73 - Коэффициент оборачиваемости оборотного капитала: оборотный капитал к продажам
* X74 - Норма денежного оборота: Денежные средства к продажам
* X75 - Денежные потоки к продажам
* X76 - Основные средства к активам
* X77 - Текущие обязательства к обязательствам
* X78 - Текущие обязательства к капиталу
* X79 - Капитал к долгосрочным обязательствам
* X80 - Денежные потоки к общим активам
* X81 - Денежный поток к обязательствам
* X82 - Финансовый директор к активам
* X83 - Денежный поток к собственному капиталу
* X84 - Текущие обязательства к оборотным активам
* X85 - Флаг пассивов-активов: 1, если общая сумма обязательств превышает общую сумму активов, 0 в противном случае
* X86 - чистая прибыль к общей сумме активов
* X87 - общая сумма активов к цене ВНП
* X88 - Интервал без кредита
* X89 - Валовая прибыль к продажам
* X90 - Чистая прибыль к акционерному капиталу
* X91 - Обязательства к капиталу
* X92 — Степень финансового рычага (DFL)
* X93 — Коэффициент покрытия процентов (процентные расходы к EBIT)
* X94 — Флаг чистой прибыли: 1, если чистая прибыль отрицательная за последние два года, 0 в противном случае
* X95 — отношение капитала к обязательствам
"""

import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings("ignore")
from IPython.display import Image
from sklearn.metrics import mean_absolute_error, mean_squared_error
from sklearn.preprocessing import MinMaxScaler
from sklearn.neighbors import KNeighborsRegressor, KNeighborsClassifier
from sklearn.model_selection import train_test_split, GridSearchCV
from sklearn.impute import SimpleImputer, MissingIndicator
from sklearn.preprocessing import LabelEncoder, OneHotEncoder, MinMaxScaler
from sklearn.model_selection import StratifiedKFold
from sklearn.model_selection import cross_val_score

#Загрузка датасета
df = pd.read_csv('data.csv', sep=",")

df.head()

# Размер набора данных
df.shape

# Типы колонок
df.dtypes

# Проверим есть ли пропущенные значения
df.isnull().sum()

"""В наборе нет пропусков, следовательно не нужно их ообрабатывать

### Обучающая и тестовая выборка
"""

#data_scalled.dtypes
X = df.drop(columns=' ROA(C) before interest and depreciation before interest')
Y = df[' ROA(C) before interest and depreciation before interest']

# Входные данные
X.head()

# Выходные данные
Y.head()

X_train,  X_test,  Y_train,  Y_test = train_test_split(X,  Y, random_state = 2022, test_size = 0.1)

# Входные параметры обучающей выборки
X_train.head()

# Входные параметры тестовой выборки
X_test.head()

# Выходные парметры обучающей выборки
Y_train.head()

# Выходные парметры обучающей выборки
Y_train.head()

"""### Дерево решений"""

from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_squared_error,accuracy_score
from sklearn.svm import SVC, NuSVC, LinearSVC
from sklearn.tree import DecisionTreeClassifier, DecisionTreeRegressor
from sklearn.model_selection import GridSearchCV
from sklearn import tree
from IPython.core.display import HTML
from sklearn.tree import export_text
from operator import itemgetter

dt_none = DecisionTreeRegressor(max_depth=5)
dt_none.fit(X_train, Y_train)

tree.plot_tree(dt_none);

tree_rules = export_text(dt_none, feature_names=list(X.columns))
HTML('<pre>' + tree_rules + '</pre>')

"""### Случайный лес"""

from sklearn.ensemble import RandomForestRegressor
from sklearn.tree import DecisionTreeClassifier, DecisionTreeRegressor, export_graphviz

# Обучим регрессор на 4 деревьях
tree1 = RandomForestRegressor(n_estimators=4, oob_score=True, random_state=2022)
tree1.fit(X, Y)

# Out-of-bag error, возвращаемый регрессором
tree1.oob_score_, 1-tree1.oob_score_

"""### Результат"""

regressor = RandomForestRegressor(n_estimators=4, random_state=2022)
regressor.fit(X_train, Y_train)
y_pred = regressor.predict(X_test)

print('Mean Absolute Error:', mean_absolute_error(Y_test, y_pred))
print('Mean Squared Error:', mean_squared_error(Y_test, y_pred))
print('Root Mean Squared Error:', np.sqrt(mean_squared_error(Y_test, y_pred)))