# -*- coding: utf-8 -*-
"""РК_1.ipynb

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1hwS1QJNA5sSCSqt4HrD4TcijlnZ9Z3LJ

# Рубежный контроль №1
## Группа: ИУ5Ц-83Б
## Студент: Соловьева Александра
### Тема: Технологии разведочного анализа и обработки данных.

* Номер варианта: 27
* Номер задачи: 4
* Номер набора данных, указанного в задаче: 3

Дополнительные требования по группам: ИУ5Ц-83Б - для произвольной колонки данных построить график "Ящик с усами (boxplot)".

### Задача №4.

Для заданного набора данных постройте основные графики, входящие в этап разведочного анализа данных. В случае наличия пропусков в данных удалите строки или колонки, содержащие пропуски. Какие графики Вы построили и почему? Какие выводы о наборе данных Вы можете сделать на основании построенных графиков?
"""

# Commented out IPython magic to ensure Python compatibility.
import sys
sys.path
import numpy as np
import pandas as pd
np.seterr(divide='ignore', invalid='ignore')
import seaborn as sns
import matplotlib.pyplot as plt
# %matplotlib inline
sns.set(style="ticks")

from sklearn.datasets import load_wine

data = load_wine()

"""### Конвертация датасета"""

# Конвертируем загруженный набор данных из sklearn в формат pandas dataframe.
df = pd.DataFrame(data.data, columns=data.feature_names)
type(df)

"""### Основные характеристики датасета"""

# Первые 5 строк датасета
df.head()

# Размер датасета 178 строк, 13 колонок
df.shape

# Список колонок
df.columns

# Список колонок с типами данных
df.dtypes

# Проверим наличие пустых значений
# Цикл по колонкам датасета
for col in df.columns:
    # Количество пустых значений - все значения заполнены
    temp_null_count = df[df[col].isnull()].shape[0]
    print('{} - {}'.format(col, temp_null_count))

"""### Визуальное исследование датасета"""

# Диаграмма рассеяния
fig, ax = plt.subplots(figsize=(10,10))
sns.scatterplot(ax=ax, x='alcohol', y='alcalinity_of_ash', data=df)

# Гистограмма
fig, ax = plt.subplots(figsize=(10,10))
sns.histplot(df['alcohol'])

# Комбинация гистограмм и диаграмм рассеивания
sns.jointplot(x='alcohol', y='alcalinity_of_ash', data=df)

"""### Построить график "Ящик с усами (boxplot)"
"""

sns.boxplot( x=df["alcohol"], y=df["alcalinity_of_ash"])

